In [98]:
import pandas as pd
import numpy as np
from datetime import datetime

In [99]:
#Read excel file as dataframe
df = pd.read_excel('Adops & Data Scientist Sample Data.xlsx')

In [100]:
#print dataframe
df.head(10)

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G
5  2019-02-01 00:24:21  LC3E1D        HVQ   GVOFK
6  2019-02-01 00:25:29  LC3561        TL6   3POLC
7  2019-02-01 00:29:15  LC3A01        TL6   N0OTG
8  2019-02-01 00:32:43  LC36FC        TL6   N0OTG
9  2019-02-01 00:35:30  LC3D80        TL6   N0OTG

In [101]:
#convert the ts column type as datetime
df['ts'] = df['ts'].astype('datetime64[ns]')

In [102]:
#Check the information of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3553 entries, 0 to 3552
Data columns (total 4 columns):
ts            3553 non-null datetime64[ns]
user_id       3553 non-null object
country_id    3553 non-null object
site_id       3553 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 111.2+ KB

In [103]:
#Q1.1
#Consider only the rows with country_id = "BDV" (there are 844 such rows). 
#For each site_id, we can compute the number of unique user_id's found in these 844 rows. 
#Which site_id has the largest number of unique users? And what's the number?

In [104]:
#Query the dataframe by country_id
df_bdv = df[df['country_id'] == 'BDV']

In [105]:
#Print out dataframe for BDV
df_bdv.head(10)

                     ts user_id country_id site_id
13  2019-02-01 00:47:58  LC3C22        BDV   N0OTG
32  2019-02-01 02:46:15  LC375A        BDV   5NPAU
87  2019-02-01 06:44:42  LC392E        BDV   N0OTG
88  2019-02-01 07:36:56  LC3FAE        BDV   5NPAU
94  2019-02-01 08:58:35  LC3AFF        BDV   3POLC
95  2019-02-01 09:07:24  LC3B5D        BDV   5NPAU
107 2019-02-01 10:06:53  LC7C30        BDV   5NPAU
132 2019-02-01 11:10:37  LC3FBE        BDV   5NPAU
134 2019-02-01 11:11:54  LCC3DB        BDV   5NPAU
135 2019-02-01 11:16:47  LC39EE        BDV   5NPAU

In [106]:
#Make unique site list from df_bdv
site_list = []
for site in df_bdv['site_id']:
    if site not in site_list:
        site_list.append(site)
site_list

['N0OTG', '5NPAU', '3POLC']

In [107]:
#count unique users by each site
unique_user_list = []
count = 0
count_list = []

for site in site_list:
    unique_df = df_bdv[df_bdv['site_id'] == site]
    for user in unique_df['user_id']:
        if user not in unique_user_list:
            unique_user_list.append(user)
    count_list.append(len(unique_user_list))
    unique_user_list = []
print(count_list)

[90, 544, 2]

In [108]:
#Q1.2
#Between 2019-02-03 00:00:00 and 2019-02-04 23:59:59, there are four users who visited a certain site more than 10 times. 
#Find these four users & which sites they (each) visited more than 10 times. 
#(Simply provides four triples in the form (user_id, site_id, number of visits) in the box below.)

In [109]:
#Query the dataframe by timeline
format = '%Y-%m-%d %H:%M:%S'
start_dt = datetime.strptime('2019-02-03 00:00:00', format)
end_dt = datetime.strptime('2019-02-04 23:59:59', format)
tf_df = df[(df['ts'] >= start_dt) & (df['ts'] <= end_dt)]
tf_df.head(10)

                      ts user_id country_id site_id
1049 2019-02-03 00:02:31  LC3C7E        TL6   3POLC
1050 2019-02-03 00:03:09  LC3C7E        TL6   3POLC
1051 2019-02-03 00:03:46  LC3C7E        TL6   3POLC
1052 2019-02-03 00:04:12  LC3C7E        TL6   3POLC
1053 2019-02-03 00:04:25  LC3C7E        TL6   3POLC
1054 2019-02-03 00:04:40  LC3C7E        TL6   3POLC
1055 2019-02-03 00:05:00  LC3C7E        TL6   3POLC
1056 2019-02-03 00:05:18  LC399D        BDV   N0OTG
1057 2019-02-03 00:05:47  LC31A0        XA7   N0OTG
1058 2019-02-03 00:06:47  LC3C7E        TL6   3POLC

In [110]:
#collect unique users in tf_df
unique_user_list=[]
for user in tf_df['user_id']:
    if user not in unique_user_list:
        unique_user_list.append(user)
print(len(unique_user_list))

708

In [111]:
#Find duplicated rows from ts_df
duplicate = tf_df.pivot_table(index = ['user_id', 'site_id'], aggfunc='count')
#Filter the number of duplicated rows that is more than 10. 
duplicate = duplicate[duplicate["country_id"] >= 10]
duplicate

                 country_id  ts
user_id site_id
LC06C3  N0OTG            25  25
LC3A59  N0OTG            26  26
LC3C7E  3POLC            15  15
LC3C9D  N0OTG            17  17

In [112]:
#Q1.3
#For each site, compute the unique number of users whose last visit (found in the original data set) was to that site. 
#For instance, user "LC3561"'s last visit is to "N0OTG" based on timestamp data. 
#Based on this measure, what are top three sites? 
#(hint: site "3POLC" is ranked at 5th with 28 users whose last visit in the data set was to 3POLC; simply provide three pairs in the form (site_id, number of users).)

In [113]:
#Collect unique sites from entire dataframe
site_list = []
for site in df['site_id']:
    if site not in site_list:
        site_list.append(site)
site_list

['N0OTG', 'QGO3G', 'GVOFK', '3POLC', '5NPAU', 'RT9Z6', 'JSUUP', 'EUZ/Q']

In [114]:
#Collect unique users from entire dataframe
unique_user_list=[]
for user in df['user_id']:
    if user not in unique_user_list:
        unique_user_list.append(user)
print(len(unique_user_list))

1916

In [115]:
#Query the dataframe by each user and collect site_id of maximum of index which is the last visit.
last_visit_site_list = []
for user in unique_user_list:
    user_df = df[df['user_id'] == user]
    last_visit_site_list.append(user_df['site_id'][max(user_df.index)])

for site in site_list:
    print("site: " + site + " = " + str(last_visit_site_list.count(site)) + "\n")

site: N0OTG = 561

site: QGO3G = 289

site: GVOFK = 42

site: 3POLC = 28

site: 5NPAU = 992

site: RT9Z6 = 2

site: JSUUP = 1

site: EUZ/Q = 1

In [116]:
#Q1.4
#For each user, determine the first site he/she visited and the last site he/she visited based on the timestamp data. 
#Compute the number of users whose first/last visits are to the same website. What is the number?

In [117]:
#Query the dataframe by each user
#Count the number of cases that site of first visit is same as site of last visit.
count = 0
for user in unique_user_list:
    user_df = df[df['user_id'] == user]
    if user_df['site_id'][min(user_df.index)] == user_df['site_id'][max(user_df.index)]:
        count = count + 1
print(count)

1670